-- phpMyAdmin SQL Dump
-- version 4.1.8
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2019-03-23 09:37:16
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `zypub`
--

-- --------------------------------------------------------

--
-- 表的结构 `zy_order_goods`
--

CREATE TABLE IF NOT EXISTS `zy_order_goods` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `order_id` int(11) NOT NULL COMMENT '关联订单id',
  `goods_id` int(11) NOT NULL COMMENT '商品id',
  `goods_name` varchar(255) NOT NULL COMMENT '商品名称',
  `goods_num` int(11) NOT NULL COMMENT '购买数量',
  `goods_img` varchar(255) NOT NULL COMMENT '商品图片',
  `final_price` decimal(10,2) NOT NULL COMMENT '最终价格',
  `goods_price` decimal(10,2) NOT NULL COMMENT '商品实际价格',
  `specid` varchar(255) NOT NULL COMMENT '规格参数',
  `specid_name` varchar(255) NOT NULL COMMENT '规格对应中文',
  `is_comment` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否评价（1已评价  0未评价）',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=66 ;

--
-- 转存表中的数据 `zy_order_goods`
--

INSERT INTO `zy_order_goods` (`id`, `order_id`, `goods_id`, `goods_name`, `goods_num`, `goods_img`, `final_price`, `goods_price`, `specid`, `specid_name`, `is_comment`) VALUES
(7, 61, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 10, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '369.00', '1-1', '红,32G', 0),
(8, 61, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 10, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '376.00', '3-2', '蓝,64G', 0),
(9, 62, 3, '泰国黑金刚莲雾 雾莲果当季 进口水果 京东生鲜 8斤', 20, 'http://pub.300c.cn/uploadfile/2019/0304/20190304095655893.jpg', '0.00', '220.00', '', '', 0),
(10, 63, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '369.00', '1-1', '红,32G', 0),
(11, 64, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(12, 65, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(13, 66, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(14, 67, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(15, 68, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(16, 69, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(17, 70, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 2, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '372.00', '2-1', '黄,32G', 0),
(18, 71, 3, '泰国黑金刚莲雾 雾莲果当季 进口水果 京东生鲜 8斤', 20, 'http://pub.300c.cn/uploadfile/2019/0304/20190304095655893.jpg', '0.00', '220.00', '', '', 0),
(19, 72, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 10, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '376.00', '3-2', '蓝,64G', 0),
(20, 73, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 19, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '369.00', '1-1', '红,32G', 0),
(21, 74, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '370.00', '1-2', '红,64G', 0),
(22, 75, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '372.00', '2-1', '黄,32G', 0),
(23, 76, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '371.00', '1-3', '红,128G', 0),
(24, 77, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 2, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '374.00', '2-3', '黄,128G', 0),
(25, 78, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '373.00', '2-2', '黄,64G', 0),
(26, 79, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '376.00', '3-2', '蓝,64G', 0),
(27, 80, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '377.00', '3-3', '蓝,128G', 0),
(28, 81, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '375.00', '3-1', '蓝,32G', 0),
(29, 82, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '370.00', '1-2', '红,64G', 0),
(30, 83, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '372.00', '2-1', '黄,32G', 0),
(31, 84, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '373.00', '2-2', '黄,64G', 0),
(32, 85, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '377.00', '3-3', '蓝,128G', 0),
(33, 86, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 2, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '375.00', '3-1', '蓝,32G', 0),
(34, 87, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '370.00', '1-2', '红,64G', 0),
(35, 88, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '372.00', '2-1', '黄,32G', 0),
(36, 88, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '373.00', '2-2', '黄,64G', 0),
(37, 88, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 3, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '376.00', '3-2', '蓝,64G', 0),
(38, 89, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '372.00', '2-1', '黄,32G', 0),
(39, 89, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '373.00', '2-2', '黄,64G', 0),
(40, 89, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '374.00', '2-3', '黄,128G', 0),
(41, 90, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-1', '红,32G', 0),
(42, 91, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 2, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-1', '红,32G', 0),
(43, 92, 30, 'Meizu/魅族6666', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112212198.png', '0.00', '693.00', '2-2', '黄,64G', 0),
(44, 93, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-1', '红,32G', 0),
(45, 94, 1, '诺基亚（NOKIA） 3310复刻版 老人机 老人手机 学生机 备用机 功能机 4G版/2G版 清新蓝 4G版本', 1, 'http://pub.300c.cn/uploadfile/2019/0307/20190307111440824.jpg', '0.00', '369.00', '1-1', '红,32G', 0),
(46, 94, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(47, 94, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-1', '红,32G', 0),
(48, 95, 29, 'Meizu/魅族', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112123394.png', '0.00', '12.00', '1-1', '红,32G', 0),
(49, 95, 30, 'Meizu/魅族6666', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112212198.png', '0.00', '693.00', '1-2', '红,64G', 0),
(50, 96, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '2-2', '黄,64G', 0),
(51, 96, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '3-1', '蓝,32G', 0),
(52, 97, 27, '华为HONOR/荣耀10青春版', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111854834.png', '0.00', '9.00', '1-1', '红,32G', 0),
(53, 98, 24, 'vivo X23幻彩版手机 vivox23限量版 vovix23新品 vivox21s x27 x21 x21i x20 x9 x30', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111523238.png', '0.00', '77.00', '3-3', '蓝,128G', 0),
(54, 99, 30, 'Meizu/魅族6666', 9, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112212198.png', '0.00', '693.00', '1-2', '红,64G', 0),
(55, 99, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-1', '红,32G', 0),
(56, 100, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-1', '红,32G', 0),
(57, 101, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 16, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-3', '红,128G', 0),
(58, 101, 30, 'Meizu/魅族6666', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112212198.png', '0.00', '693.00', '1-1', '红,32G', 0),
(59, 102, 29, 'Meizu/魅族', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112123394.png', '0.00', '12.00', '2-3', '黄,128G', 0),
(60, 103, 21, 'Meitu/美图 T9美图T9手机新款双卡双待美颜拍照手机 美图手机正品', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312110903703.png', '0.00', '3333.00', '2-2', '黄,64G', 0),
(61, 104, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 4, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-2', '红,64G', 0),
(62, 105, 26, 'Apple/苹果 iPhone 7 Plus苹果7代5.5寸全新7p手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111728893.png', '0.00', '4.00', '1-1', '红,32G', 0),
(63, 105, 31, 'Meizu/魅族 16th骁龙845 超窄边框全面屏 屏下指纹解锁 双摄拍照旗舰手机', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312112252497.png', '0.00', '89.00', '1-1', '红,32G', 0),
(64, 106, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-1', '红,32G', 0),
(65, 106, 28, '华为HONOR/荣耀10青春版V珍珠全面屏2400万AI自拍渐变色智能学生游戏拍照手机官方旗舰店网', 1, 'http://pub.300c.cn/uploadfile/2019/0312/20190312111950603.png', '0.00', '666.00', '1-2', '红,64G', 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
