-- phpMyAdmin SQL Dump
-- version 4.1.8
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2019-03-23 09:36:53
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `zypub`
--

-- --------------------------------------------------------

--
-- 表的结构 `zy_order`
--

CREATE TABLE IF NOT EXISTS `zy_order` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `ordersn` varchar(255) CHARACTER SET utf8 NOT NULL,
  `shopid` int(11) NOT NULL COMMENT '商品id',
  `storeid` int(11) NOT NULL COMMENT '店铺id',
  `buycarid` int(11) NOT NULL COMMENT '购物车id',
  `status` int(11) NOT NULL COMMENT '状态 1:待支付 2:待发货  3:待收货 4:待评价 5:已完成 6:已取消 7:申请退款 8:退款成功 9:客服介入 10:售后',
  `prestatus` int(11) NOT NULL COMMENT '上一次操作状态',
  `shstatus` int(11) NOT NULL COMMENT '售后/1：审核中 2:待退货 3:进行中 4:撤回申请 5:拒绝售后 6:超时取消申请 7:售后成功',
  `userid` int(11) NOT NULL COMMENT '购买用户id',
  `lx_mobile` varchar(15) NOT NULL COMMENT '联系电话',
  `lx_name` varchar(50) CHARACTER SET utf8 NOT NULL COMMENT '联系人',
  `lx_code` varchar(50) CHARACTER SET utf8 NOT NULL COMMENT '邮编',
  `province` char(20) CHARACTER SET utf8 NOT NULL COMMENT '收货地址_省',
  `city` char(20) CHARACTER SET utf8 NOT NULL COMMENT '收货地址_市',
  `area` char(30) CHARACTER SET utf8 NOT NULL COMMENT '收货地址_区',
  `address` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT '收货地址_详细地址',
  `addtime` int(18) NOT NULL COMMENT '添加时间',
  `paytime` int(11) NOT NULL COMMENT '支付时间',
  `fhtime` int(11) NOT NULL COMMENT '发货时间',
  `shipper_name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `shipper_code` varchar(255) CHARACTER SET utf8 NOT NULL,
  `logistics_order` varchar(255) CHARACTER SET utf8 NOT NULL,
  `freeship` int(11) NOT NULL COMMENT '免邮',
  `freight` int(11) NOT NULL COMMENT '运费',
  `totalprice` decimal(11,2) NOT NULL COMMENT '总价',
  `pay_type` int(11) NOT NULL COMMENT '支付方式 1:余额 2:支付宝 3:微信',
  `usernote` text CHARACTER SET utf8 NOT NULL COMMENT '备注',
  `remind` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT '提醒',
  `tk_reason` text NOT NULL COMMENT '退款理由',
  `tk_explain` text NOT NULL,
  `refuse_reason` text NOT NULL COMMENT '拒绝理由',
  `sale_shipper_name` text NOT NULL COMMENT '售后快递公司',
  `sale_shipper_code` text NOT NULL COMMENT '售后快递code',
  `sale_logistics_order` text NOT NULL COMMENT '售后快递单号',
  `sale_type` int(11) NOT NULL COMMENT '售后类型(1.直接退款 2.退货退款)',
  `kd_type` int(11) NOT NULL COMMENT '快递类型(1.有快递 2.没快递)',
  `isgroup_buy` int(11) NOT NULL COMMENT '是否团购(0.不是 1.是团购)',
  `lastperson` int(11) NOT NULL DEFAULT '0' COMMENT '成团的剩余人数',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=107 ;

--
-- 转存表中的数据 `zy_order`
--

INSERT INTO `zy_order` (`id`, `ordersn`, `shopid`, `storeid`, `buycarid`, `status`, `prestatus`, `shstatus`, `userid`, `lx_mobile`, `lx_name`, `lx_code`, `province`, `city`, `area`, `address`, `addtime`, `paytime`, `fhtime`, `shipper_name`, `shipper_code`, `logistics_order`, `freeship`, `freight`, `totalprice`, `pay_type`, `usernote`, `remind`, `tk_reason`, `tk_explain`, `refuse_reason`) VALUES
(62, '1552268276', 0, 12, 0, 7, 3, 4, 1, '', 'CY', '318000', '浙江省', '台州市', '椒江区', '君悦大厦', 1552267649, 0, 0, '', '', '', 0, 0, '4400.00', 0, '', '', '122112', '212121', '0'),
(61, '1552267785', 0, 1, 0, 7, 3, 4, 1, '', 'CY', '318000', '浙江省', '台州市', '椒江区', '君悦大厦', 1552267649, 0, 0, '', '', '', 0, 0, '7450.00', 0, '', '', '323232', '323232', '0'),
(63, '1552372271', 0, 1, 0, 7, 4, 4, 25, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552372062, 0, 0, '', '', '', 0, 0, '369.00', 0, '', '', '34433434', '343434', '0'),
(64, '1552372951', 0, 1, 0, 7, 4, 4, 25, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552372280, 0, 0, '', '', '', 0, 0, '666.00', 0, '', '', '212121', '21211212', '0'),
(65, '1552372770', 0, 1, 0, 1, 0, 0, 1, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552372586, 0, 0, '', '', '', 0, 0, '666.00', 0, '', '', '0', '', '0'),
(66, '1552373529', 0, 1, 0, 7, 4, 4, 25, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552372591, 0, 0, '', '', '', 0, 0, '666.00', 0, '', '', '122121', '212121', '0'),
(67, '1552373228', 0, 1, 0, 7, 4, 4, 25, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552372601, 0, 0, '', '', '', 0, 0, '666.00', 0, '', '', '212112', '32323223', '0'),
(68, '1552373158', 0, 1, 0, 6, 0, 0, 25, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552372605, 0, 0, '', '', '', 0, 0, '666.00', 0, '', '', '0', '', '0'),
(69, '1552372793', 0, 1, 0, 3, 0, 0, 25, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552372614, 0, 1552894666, '韵达快递', 'YDKY', '3833863021764', 0, 0, '666.00', 0, '', '提醒发货', '0', '', '0'),
(70, '1552374596', 0, 1, 0, 6, 0, 0, 25, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552373626, 0, 0, '', '', '', 0, 0, '744.00', 0, '', '', '0', '', '0'),
(71, '1552373941', 0, 12, 0, 6, 0, 0, 25, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552373626, 0, 0, '', '', '', 0, 0, '4400.00', 0, '', '', '0', '', '0'),
(72, '1552375100', 0, 1, 0, 6, 0, 0, 25, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552374138, 0, 0, '韵达快递', 'YDKY', '3833863021764', 0, 0, '3760.00', 0, '', '', '0', '', '0'),
(73, '1552374760', 0, 1, 0, 3, 0, 0, 25, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552374423, 0, 0, '韵达快递', 'YDKY', '3833863021764', 0, 0, '7011.00', 0, '', '', '0', '', '0'),
(74, '1552375147', 0, 1, 0, 6, 0, 0, 25, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552374594, 0, 0, '韵达快递', 'YDKY', '3833863021764', 0, 0, '370.00', 0, '', '', '0', '', '0'),
(75, '1552375277', 0, 1, 0, 6, 0, 0, 25, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552374680, 0, 0, '', '', '', 0, 0, '372.00', 0, '', '', '0', '', '0'),
(76, '1552375709', 0, 1, 0, 6, 0, 0, 25, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552374808, 0, 0, '', '', '', 0, 0, '371.00', 0, '', '', '0', '', '0'),
(77, '1552375685', 0, 1, 0, 6, 0, 0, 25, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552374953, 0, 0, '', '', '', 0, 0, '748.00', 0, '', '', '0', '', '0'),
(78, '1552375853', 0, 1, 0, 1, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552375111, 0, 0, '', '', '', 0, 0, '373.00', 0, '', '', '0', '', '0'),
(79, '1552376172', 0, 1, 0, 7, 0, 0, 1, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552375199, 0, 0, '', '', '', 0, 0, '376.00', 0, '', '', '0', '', '0'),
(80, '1552376062', 0, 1, 0, 1, 0, 0, 1, '', 'ASDSD ', '　', '北京市', '北京市', '东城区', 'asdasd asdas d', 1552375424, 0, 0, '', '', '', 0, 0, '377.00', 0, '', '', '0', '', '0'),
(81, '1552375696', 0, 1, 0, 7, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552375559, 0, 0, '', '', '', 0, 0, '375.00', 0, '', '', '0', '', '0'),
(82, '1552376521', 0, 1, 0, 7, 7, 4, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552375861, 0, 0, '', '', '', 0, 0, '370.00', 0, '', '', '', '', '0'),
(83, '1552376893', 0, 1, 0, 4, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552375901, 0, 0, '', '', '', 0, 0, '372.00', 0, '', '', '0', '', '0'),
(84, '1552376910', 0, 1, 0, 4, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552376353, 0, 0, '', '', '', 0, 0, '373.00', 0, '', '', '0', '', '0'),
(85, '1552376602', 0, 1, 0, 4, 0, 0, 1, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552376477, 0, 0, '', '', '', 0, 0, '377.00', 0, '', '', '0', '', '0'),
(86, '1552377140', 0, 1, 0, 4, 0, 0, 1, '', '啊实打', '　', '北京市', '北京市', '东城区', '让他好人好事电吹风', 1552376698, 0, 1552558820, '申通快递', 'STO', '804252521075355716', 0, 0, '750.00', 0, '', '', '0', '', '0'),
(87, '1552377754', 0, 1, 0, 7, 2, 4, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552376759, 0, 0, '', '', '', 0, 0, '370.00', 0, '', '', '0', '', '0'),
(88, '1552378186', 0, 1, 0, 7, 2, 4, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552377829, 0, 0, '', '', '', 0, 0, '1873.00', 0, '', '', '0', '', '0'),
(89, '1552378710', 0, 1, 0, 7, 2, 4, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552377878, 0, 0, '', '', '', 0, 0, '1119.00', 0, '', '', '0', '', '0'),
(90, '1552560404', 0, 1, 0, 4, 0, 0, 1, '', 'ASDSD ', '　', '北京市', '北京市', '东城区', 'asdasd asdas d', 1552559968, 0, 1552560012, '中通快递', 'ZTO', '804252521075355716', 0, 0, '89.00', 0, '', '', '0', '', '0'),
(91, '1552560757', 0, 1, 0, 7, 2, 4, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552560119, 0, 0, '', '', '', 0, 0, '178.00', 0, '', '', '0', '', '0'),
(92, '1552630109', 0, 1, 0, 1, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552629193, 0, 0, '', '', '', 0, 0, '693.00', 0, '', '', '0', '', '0'),
(93, '1552629814', 0, 1, 0, 7, 2, 4, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552629253, 0, 0, '', '', '', 0, 0, '89.00', 0, '', '', '0', '', '0'),
(94, '1552629579', 0, 1, 0, 4, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552629323, 0, 1552708423, '中通快递', 'ZTO', '541654898797654165', 0, 0, '1124.00', 0, '', '', '0', '', '0'),
(95, '1552708639', 0, 1, 0, 7, 2, 4, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552708313, 0, 0, '', '', '', 0, 0, '705.00', 0, '', '', '0', '', '0'),
(96, '1552721268', 0, 1, 0, 4, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552720467, 0, 1552720492, '申通快递', 'STO', '465464546546546', 0, 0, '178.00', 0, '', '', '0', '', '0'),
(97, '1552727101', 0, 1, 0, 6, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552726378, 0, 0, '', '', '', 0, 0, '9.00', 0, '', '', '0', '', '0'),
(98, '1552891866', 0, 1, 0, 2, 0, 0, 1, '', 'CBA', '　', '浙江省', '台州市', '椒江区', '84646464', 1552891090, 0, 0, '', '', '', 0, 0, '77.00', 0, '', '提醒发货', '', '', ''),
(99, '1552892769', 0, 1, 0, 2, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552892111, 0, 0, '', '', '', 0, 0, '6326.00', 0, '', '', '', '', ''),
(100, '1552897625', 0, 1, 0, 2, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552897246, 0, 0, '', '', '', 0, 0, '89.00', 0, '', '', '', '', ''),
(101, '1552897648', 0, 1, 0, 2, 0, 0, 1, '', '日访问权威', '　', '北京市', '北京市', '海淀区', '强无敌群翁群翁群翁权威', 1552897445, 0, 0, '', '', '', 0, 0, '11349.00', 0, '', '', '', '', ''),
(102, '1552898236', 0, 1, 0, 3, 0, 0, 1, '', 'CBA', '　', '浙江省', '台州市', '椒江区', '84646464', 1552897500, 0, 1553053717, '申通快递', 'STO', 'asdas dasdasd ', 0, 0, '12.00', 0, '', '', '', '', ''),
(103, '1552984220', 0, 1, 0, 1, 0, 0, 27, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552983679, 0, 0, '', '', '', 0, 0, '3333.00', 0, '', '', '', '', ''),
(104, '1552984688', 0, 1, 0, 1, 0, 0, 1, '', '客流量路口', '　', '北京市', '北京市', '宣武区', '4555556', 1552983812, 0, 0, '', '', '', 0, 0, '356.00', 0, '', '', '', '', ''),
(105, '1552985505', 0, 1, 0, 1, 0, 0, 27, '', '魏小杰', '　', '北京市', '北京市', '东城区', '朝阳区1号', 1552984896, 0, 0, '', '', '', 0, 0, '93.00', 0, '', '', '', '', ''),
(106, '1553053168', 0, 1, 0, 1, 0, 0, 1, '', '客流量路口', '　', '北京市', '北京市', '宣武区', '4555556', 1553052956, 0, 0, '', '', '', 0, 0, '1332.00', 0, '', '', '', '', '');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
